In [3]:
import pandas as pd

In [5]:
left = pd.DataFrame({'col1':[1,2,3,4,5], 'col2':['a','b','c','d','e']})
right = pd.DataFrame({'col1':[3,4,5,6,7], 'col3':['f','g','h','i','j']})

print(right)
print(left)

   col1 col3
0     3    f
1     4    g
2     5    h
3     6    i
4     7    j
   col1 col2
0     1    a
1     2    b
2     3    c
3     4    d
4     5    e

In [33]:
pd.merge(left=left,right=right,on = 'col1',how = 'inner') #inner is the default setting it combines the common values

   col1 col2 col3
0     3    c    f
1     4    d    g
2     5    e    h

In [10]:
pd.merge(left,right,on = 'col1',how = 'left') #taking col1 data from the left assigned dataset

   col1 col2 col3
0     1    a  NaN
1     2    b  NaN
2     3    c    f
3     4    d    g
4     5    e    h

In [11]:
pd.merge(left,right,on = 'col1',how = 'right')#taking col1 data from the right assigned dataset

   col1 col2 col3
0     3    c    f
1     4    d    g
2     5    e    h
3     6  NaN    i
4     7  NaN    j

In [13]:
pd.merge(left,right,on = 'col1',how = 'outer') #union of both datasets

   col1 col2 col3
0     1    a  NaN
1     2    b  NaN
2     3    c    f
3     4    d    g
4     5    e    h
5     6  NaN    i
6     7  NaN    j

In [14]:
pd.concat([left,right],axis = 0) #axis 0 means concatenation along the indexes 1 means along columns 0 is default

   col1 col2 col3
0     1    a  NaN
1     2    b  NaN
2     3    c  NaN
3     4    d  NaN
4     5    e  NaN
0     3  NaN    f
1     4  NaN    g
2     5  NaN    h
3     6  NaN    i
4     7  NaN    j

In [15]:
pd.concat([left,right],ignore_index = True)

   col1 col2 col3
0     1    a  NaN
1     2    b  NaN
2     3    c  NaN
3     4    d  NaN
4     5    e  NaN
5     3  NaN    f
6     4  NaN    g
7     5  NaN    h
8     6  NaN    i
9     7  NaN    j

In [21]:
hero_dc = pd.read_pickle('hero_dc_pkl.pkl')
hero_marvel = pd.read_pickle('hero_marvel_pkl.pkl')

In [22]:
hero_dc.head(1)

,name,Gender,Eye color,Race,Hair color,Height,Publisher,Alignment,Weight
0,Abin Sur,Male,blue,Ungaran,No Hair,185,DC Comics,good,90.0

In [23]:
hero_marvel.head(1)

,name,Gender,Eye color,Race,Hair color,Height,Publisher,Alignment,Weight
0,A-Bomb,Male,yellow,Human,No Hair,203,Marvel Comics,good,441

In [29]:
hero_dc.shape
hero_marvel.shape

(388, 9)

In [30]:
hero_info = pd.concat([hero_dc,hero_marvel],ignore_index = True)

In [31]:
hero_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 603 entries, 0 to 602
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        603 non-null    string
 1   Gender      603 non-null    category
 2   Eye color   603 non-null    string
 3   Race        603 non-null    string
 4   Hair color  603 non-null    object
 5   Height      603 non-null    int64
 6   Publisher   603 non-null    object
 7   Alignment   603 non-null    object
 8   Weight      532 non-null    float64
dtypes: category(1), float64(1), int64(1), object(3), string(3)
memory usage: 38.5+ KB

In [32]:
hero_info.head(1)

,name,Gender,Eye color,Race,Hair color,Height,Publisher,Alignment,Weight
0,Abin Sur,Male,blue,Ungaran,No Hair,185,DC Comics,good,90.0

In [35]:
hero_info.info(verbose = True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 603 entries, 0 to 602
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        603 non-null    string
 1   Gender      603 non-null    category
 2   Eye color   603 non-null    string
 3   Race        603 non-null    string
 4   Hair color  603 non-null    object
 5   Height      603 non-null    int64
 6   Publisher   603 non-null    object
 7   Alignment   603 non-null    object
 8   Weight      532 non-null    float64
dtypes: category(1), float64(1), int64(1), object(3), string(3)
memory usage: 38.5+ KB

In [42]:
hero_info.columns = hero_info.columns.str.lower() #Renaming column names to make it consistent

In [43]:
hero_info.head(1)

,name,gender,eye color,race,hair color,height,publisher,alignment,weight
0,Abin Sur,Male,blue,Ungaran,No Hair,185,DC Comics,good,90.0

In [45]:
hero_info = hero_info.rename(columns = {'gender':'sex'})

In [46]:
hero_info = hero_info.rename(columns = str.upper)

In [47]:
hero_info.head(2)

,NAME,SEX,EYE COLOR,RACE,HAIR COLOR,HEIGHT,PUBLISHER,ALIGNMENT,WEIGHT
0,Abin Sur,Male,blue,Ungaran,No Hair,185,DC Comics,good,90.0
1,Adam Strange,Male,blue,Human,Blond,185,DC Comics,good,88.0

In [49]:
hero_info = hero_info.rename(mapper= str.lower, axis = 1)

In [50]:
hero_info.head(2)

,name,sex,eye color,race,hair color,height,publisher,alignment,weight
0,Abin Sur,Male,blue,Ungaran,No Hair,185,DC Comics,good,90.0
1,Adam Strange,Male,blue,Human,Blond,185,DC Comics,good,88.0

In [51]:
hero_info.to_pickle('hero_info.pkl')